{
  "title": "Obstracts by dogesec",
  "slug": "dogesec-obstracts",
  "description": "The OpenCTI Obstracts Connector bridges the gap between unstructured open-source reporting and operational threat intelligence by seamlessly ingesting intelligence derived from security blogs into OpenCTI.\n\nPowered by Obstracts, the connector continuously synchronizes intelligence generated from the blogs your team subscribes to, automatically extracting indicators, attack patterns, threat actors, malware, vulnerabilities, and other STIX-compliant objects. This allows SOC teams and threat intelligence analysts to turn high-signal blog content into structured, searchable intelligence within OpenCTI—without manual parsing or enrichment.\n\nDesigned for reliability and scale, the connector supports both historical backfill and incremental polling, ensuring OpenCTI stays up to date as new intelligence is published. Analysts can scope ingestion to all subscribed blogs or restrict it to specific feeds, balancing coverage with relevance.\n\nFor teams looking to operationalize open-source intelligence from trusted security blogs, the OpenCTI Obstracts Connector provides a low-friction, automated path from narrative reporting to actionable CTI.",
  "short_description": "The OpenCTI Obstracts Connector synchronizes intelligence from the blogs you are subscribed to in Obstracts into OpenCTI.",
  "logo": "external-import/dogesec-obstracts/__metadata__/logo.png",
  "use_cases": [
    "Commercial Threat Intel",
    "Open Source Threat Intel"
  ],
  "verified": false,
  "last_verified_date": null,
  "playbook_supported": false,
  "max_confidence_level": 50,
  "support_version": ">=6.8.0",
  "subscription_link": "https://www.obstracts.com/",
  "source_code": "https://github.com/OpenCTI-Platform/connectors/tree/master/external-import/dogesec-obstracts",
  "manager_supported": false,
  "container_version": "7.260227.0",
  "container_image": "opencti/connector-dogesec-obstracts",
  "container_type": "EXTERNAL_IMPORT"
}