{
  "title": "Cognyte Luminar",
  "slug": "luminar",
  "description": "Cognyte is a global leader in security analytics software that empowers governments and enterprises with Actionable Intelligence for a safer world. Our open software fuses, analyzes and visualizes disparate data sets at scale to help security organizations find the needles in the haystacks. Over 1,000 government and enterprise customers in more than 100 countries rely on Cognyte’s solutions to accelerate security investigations and connect the dots to successfully identify, neutralize, and prevent threats to national security, business continuity and cyber security. Luminar is an asset-based cybersecurity intelligence platform that empowers enterprise organizations to build and maintain a proactive threat intelligence operation that enables to anticipate and mitigate cyber threats, reduce risk, and enhance security resilience. Luminar enables security teams to define a customized, dynamic monitoring plan to uncover malicious activity in its earliest stages on all layers of the Web.\n\nThis integration connects with the Luminar Threat Intelligence TAXII version 2 server and feed OpenCTI Platform with the following feeds: IOC, Leaked Records, Cyber Feeds.",
  "short_description": "Cognyte is a global leader in security analytics software that empowers governments and enterprises with Actionable Intelligence for a safer world. Our open software fuses, analyzes and visualizes disparate data sets at scale to help security organizations find the needles in the haystacks.",
  "logo": "external-import/luminar/__metadata__/logo.png",
  "use_cases": [
    "Commercial Threat Intel"
  ],
  "verified": false,
  "last_verified_date": null,
  "playbook_supported": false,
  "max_confidence_level": 50,
  "support_version": ">= 6.5.1",
  "subscription_link": "https://www.cognyte.com/solutions/external-threat-intelligence/",
  "source_code": "https://github.com/OpenCTI-Platform/connectors/tree/master/external-import/luminar",
  "manager_supported": false,
  "container_version": "7.260227.0",
  "container_image": "opencti/connector-luminar",
  "container_type": "EXTERNAL_IMPORT"
}